### lecture 6 - data input and output

- csv
- excel
- html
- sql

In [71]:
import numpy as np
import pandas as pd
from sqlalchemy import create_engine

In [29]:
df = pd.read_csv('./datasets/example.csv')

In [30]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [50]:
df.to_csv('./datasets/my_output.csv', index = False)

In [53]:
pd.read_csv('./datasets/my_output.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [56]:
pd.read_excel('./datasets/Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [59]:
df.to_excel('./datasets/Excel_Sample2.xlsx', sheet_name='NewSheet')

In [61]:
data = pd.read_html('https://www.fdic.gov/bank-failures/failed-bank-list')

In [66]:
type(data)

list

In [69]:
data[0].head()

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
1,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
2,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
3,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
4,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543

that code is going to create a temporary sql light engine database that is running in memory

In [ ]:
engine = create_engine('sqlite:///:memory:')

In [ ]:
df.to_sql('./datasets/my_table', engine)

In [79]:
sqldf = pd.read_sql('./datasets/my_table', con = engine)

In [80]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15